Revit 2027 API
StructuralFramingUtils.GetEndReference Method
 Returns a reference to the end of a framing element according to the setback settings.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static Reference GetEndReference(
	FamilyInstance familyInstance,
	int end
)
Public Shared Function GetEndReference (
	familyInstance As FamilyInstance,
	end As Integer
) As Reference
public:
static Reference^ GetEndReference(
	FamilyInstance^ familyInstance,
	int end
)
static member GetEndReference :
        familyInstance : FamilyInstance *
        end : int -> Reference
Parameters
familyInstance FamilyInstance
 The FamilyInstance, which must be of a structural framing category, non-concrete and joined.
end Int32
 The index of the end (0 for the start, 1 for the end).
Return Value
Reference
 The end reference.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
ArgumentOutOfRangeException |  end must be 0 or 1.
ArgumentsInconsistentException |  The input familyInstance is not of a structural framing category or is concrete or is not joined at given end and cannot have an end reference set.
See Also
Reference
StructuralFramingUtils Class
Autodesk.Revit.DB.Structure Namespace